# HostPanelScheduleAsPanelParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HostPanelScheduleAsPanelParam Property
ParameterTypeId Class See Also
---
"Categorize as"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HostPanelScheduleAsPanelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostPanelScheduleAsPanelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HostPanelScheduleAsPanelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace